MyDIPLOM/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyDIPLOM/src/CommonForms/ВКМ_КалендарьСпециалистов/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщик();
	
	ОбслуживаниеКлиента = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиента.Следующий() Цикл
		
		ДатаРабот = Формат(ОбслуживаниеКлиента.ДатаПроведенияРабот, "ДФ=""ггггММдд""");
		ВремяНачало = Формат(ОбслуживаниеКлиента.ВремяНачалаРабот, "ДФ=""ЧЧммсс""");
		ВремяОкончания = Формат(ОбслуживаниеКлиента.ВремяОкончанияРабот, "ДФ=""ЧЧммсс""");
		
		НачалоРабот = Дата(ДатаРабот + ВремяНачало);
		ОкончаниеРабот = Дата(ДатаРабот + ВремяОкончания);
		
		ЭлементПланировщик = Планировщик.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		ЭлементПланировщик.Значение = ОбслуживаниеКлиента.Ссылка;
		ЭлементПланировщик.Текст = ОбслуживаниеКлиента.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ОбслуживаниеКлиента" Тогда
		ОбновитьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеЗаполнения = Новый Структура;
	ЗначениеЗаполнения.Вставить("ВКМ_ДатаПроведенияРабот", Формат(Начало, "ДФ=""ддММгггг"""));
	ЗначениеЗаполнения.Вставить("ВКМ_ВремяНачалаРабот", Формат(Начало, "ДФ=""ЧЧммсс"""));
	ЗначениеЗаполнения.Вставить("ВКМ_ВремяОкончанияРабот", Формат(Конец, "ДФ=""ЧЧммсс"""));
	ЗначениеЗаполнения.Вставить("ВКМ_Специалист", Текст); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеЗаполнения", ЗначениеЗаполнения); 
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыФормы);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПланировщик()
	
	НачалоПериода = НачалоНедели(ТекущаяДатаСеанса());
	КонецПериода = КонецНедели(ТекущаяДатаСеанса());
	
	Планировщик.Элементы.Очистить();
	
	ОбслуживаниеКлиента = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока ОбслуживаниеКлиента.Следующий() Цикл
		
		ДатаРабот = Формат(ОбслуживаниеКлиента.ДатаПроведенияРабот, "ДФ=""ггггММдд""");
		ВремяНачало = Формат(ОбслуживаниеКлиента.ВремяНачалаРабот, "ДФ=""ЧЧммсс""");
		ВремяОкончания = Формат(ОбслуживаниеКлиента.ВремяОкончанияРабот, "ДФ=""ЧЧммсс""");
		
		НачалоРабот = Дата(ДатаРабот + ВремяНачало);
		ОкончаниеРабот = Дата(ДатаРабот + ВремяОкончания);
		
		ЭлементПланировщик = Планировщик.Элементы.Добавить(НачалоРабот, ОкончаниеРабот);
		ЭлементПланировщик.Значение = ОбслуживаниеКлиента.Ссылка;
		ЭлементПланировщик.Текст = ОбслуживаниеКлиента.Специалист;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
